INSERT INTO COUNTRY (NAME)
VALUES ('Russia');

INSERT INTO CITY (COUNTRY, NAME)
VALUES (1, 'Saint-Petersburg'),
       (1, 'Moscow'),
       (1, 'Sochi');

INSERT INTO HOTEL (CITY, NAME, ADDRESS, HOTEL_TYPE, STARS, DESCRIPTION)
VALUES (1, 'Ivan da Marya', 'Sadovaya 32 apt 61, Центральный район', 'HOTEL', 0, 'Отель «Иван да Марья» удобно расположен в Центральном районе Санкт-Петербурга, в 1,4 км от Исаакиевского собора, в 1,5 км от Государственного Русского музея и в 1,7 км от Свято-Николаевского военно-морского собора. В распоряжении гостей общая кухня, общий лаундж и бесплатный Wi-Fi на всей территории. В отеле имеются семейные номера. \n Среди популярных достопримечательностей вблизи отеля - музей Фаберже, Дворцовая площадь и Зимний дворец. Расстояние до аэропорта Пулково составляет 14 км. \n Это любимая часть города Санкт-Петербург среди наших гостей согласно независимым отзывам. \n Парам особенно нравится расположение — они оценили проживание в этом районе для поездки вдвоем на 9,8. \n Мы говорим на вашем языке!'),
       (1, 'Коттедж в городе', '38 улица Корякова, Выборгский район', 'GUEST_HOUSES', 4, 'Дом для отпуска «Коттедж в городе» расположен примерно в 12 км от стадиона «Петровский». К услугам гостей патио. Дом оснащен чайником. Из окон открывается вид на озеро. Дом для отпуска находится рядом с пляжем. Гости могут отдохнуть в общем лаундже и в саду, а также воспользоваться принадлежностями для барбекю. \n В числе удобств дома для отпуска — 6 спален, гостиная, телевизор с плоским экраном, оборудованная кухня с обеденной зоной, а также 2 ванные комнаты с душем и стиральной машиной. \n В распоряжении гостей терраса. Окрестности отлично подходят для прогулок. \n Стадион «Газпром Арена» и Летний сад находятся в 14 км от дома для отпуска «Коттедж в городе». Расстояние до международного аэропорта Пулково составляет 28 км. \n Мы говорим на вашем языке!'),
       (1, 'Nevsky 22 LUX Apart', '22 Невский проспект, Центральный район', 'HOTEL', 4, ''),
       (1, 'Гостевой Дом Old Flat на Жуковского', 'Улица Жуковского 6, Центральный район', 'GUEST_HOUSES', 0, 'Этот хостел находится в центре Санкт-Петербурга, всего в 7 минутах ходьбы от оживленного Невского проспекта. В хостеле Old Flat na Zhukovskogo предоставляется бесплатный Wi-Fi. \n Светлые общие номера оформлены в строгом стиле и оснащены телевизором с плоским экраном. Общие ванные комнаты расположены в коридоре. \n Гости могут приготовить блюда на небольшой общей кухне с обеденной зоной. Различные кафе и рестораны находятся в 5 минутах ходьбы от хостела. \n До Аничкова моста можно дойти за 10 минут, а до Казанского собора - за 20 минут. \n Станция метро "Маяковская" расположена в 8 минутах ходьбы от хостела Old Flat na Zhukovskogo. Расстояние от хостела до Московского железнодорожного вокзала составляет 1 км, а до международного аэропорта Пулково - 20 км. \n Это любимая часть города Санкт-Петербург среди наших гостей согласно независимым отзывам. \n Мы говорим на вашем языке!'),
       (1, 'Гостевой дом на Слободской', 'Улица Слободская 3, Невский район', 'HOTEL', 0, 'Этот отель расположен в центре Санкт-Петербурга, в 10 минутах ходьбы от Александро-Невской лавры. В гостевом доме «На Слободской» к услугам гостей бесплатный Wi-Fi и круглосуточная стойка регистрации. \n Светлые номера с кондиционером оформлены в классическом стиле в теплых тонах. В каждом номере есть телевизор, холодильник и собственная ванная комната. \n Каждое утро в номер подается завтрак. В 10 минутах ходьбы от отеля работают различные кафе и рестораны. \n Оживленный Невский проспект находится в 15 минутах ходьбы от отеля, а набережная Невы - всего в нескольких минутах ходьбы. \n Станция метро «Александра Невского» находится в 15 минутах ходьбы от гостевого дома «На Слободской». Расстояние до Московского железнодорожного вокзала составляет 3,5 км, а до международного аэропорта Пулково — 16 км.'),
       (1, 'Номера на Невском 111', 'Невский проспект 111, этаж 4, Центральный район', 'HOTEL', 2, 'Отель «Номера на Невском, 111» удобно расположен в центре Санкт-Петербурга. К услугам гостей бесплатный Wi-Fi и общий лаундж. Государственный Русский музей находится в 2,4 км, до храма Спаса на Крови 2,6 км, а до Дворцовой площади 3,3 км. \n Номера оснащены телевизором с плоским экраном. В числе удобств платяной шкаф и собственная ванная комната с феном, тапочками и бесплатными туалетно-косметическими принадлежностями. В распоряжении гостей некоторых номеров мини-кухня с плитой, микроволновой печью и холодильником. \n Сотрудники круглосуточной стойки регистрации, говорящие на русском и английском языках, с удовольствием предоставят туристическую информацию. \n Эрмитаж находится в 3,3 км от гостиницы «Номера на Невском, 111». Расстояние до станции метро «Площадь Восстания» составляет 400 метров. \n Это любимая часть города Санкт-Петербург среди наших гостей согласно независимым отзывам. \n Парам особенно нравится расположение — они оценили проживание в этом районе для поездки вдвоем на 9,4. \n Мы говорим на вашем языке! '),
       (1, 'M28', '28 embankment river Moyka литера Б, пом 1-Н, Центральный район', 'APARTMENT', 3, 'Апартаменты «М28» с бесплатным Wi-Fi расположены в Санкт-Петербурге, недалеко от Дворцовой площади, Эрмитажа и храма Спаса-на-Крови. \n Во всех апартаментах есть полностью оборудованная мини-кухня с микроволновой печью, гостиный уголок, телевизор с плоским экраном, стиральная машина и собственная ванная комната с душем и феном. В числе удобств холодильник, плита, чайник и кофемашина. \n Рядом с апарт-отелем находятся такие популярные достопримечательности, как Исаакиевский собор, Зимний дворец и Летний сад. Расстояние до аэропорта Пулково составляет 16 км. \n Это любимая часть города Санкт-Петербург среди наших гостей согласно независимым отзывам.'),

       (2, 'Pentahotel Moscow, Arbat', 'Ulitsa Novyy Arbat 15, Арбат', 'HOTEL', 4, 'Pentahotel Moscow, Arbat features 4-star pet-friendly accommodation in Moscow. The lifestyle hotel has a fitness centre and a terrace. Free WiFi is available throughout the property. \n All air-conditioned rooms in the hotel are equipped with a flat-screen TV and minibar. The private bathroom is fitted with a bath or shower and free toiletries. \n A buffet breakfast is available daily at the accommodation. \n A highlight of the hotel is the Pentalounge – a space that combines a lounge, bar, cafe, and reception, creating an interior and atmosphere of a cosy living room. \n An array of activities can be enjoyed on site or in the surroundings, including cycling and billiards. Bike rental is featured on site. The staff at reception can offer guests advice about the area to plan their day. \n Arbat Street is 300 metres from Pentahotel Moscow, Arbat, while Pushkin Museum of Fine Arts is 2.4 km away.'),
       (2, 'Tverskaya Residence', 'Tverskaya Street 9 building 5', 'HOTEL', 3, 'Отель Tverskaya Residence расположен в Москве, в 1,1 км от Большого театра и в 1,5 км от Государственного исторического музея. К услугам гостей номера с собственной ванной комнатой. Стойка регистрации открыта круглосуточно, гости могут посетить ресторан. В отеле работает бесплатный Wi-Fi. \n Во всех номерах отеля установлен письменный стол. В номерах отеля Tverskaya Residence есть гостиный уголок. \n По утрам для гостей накрывают континентальный завтрак. \n Мавзолей Ленина и ГУМ находятся в 2,4 км. \n Это любимая часть города Москва среди наших гостей согласно независимым отзывам. '),
       (2, 'А.Kosterev Hotel Moscow', '9А строение 5 Tverskaya Street', 'HOTEL', 0, ''),
       (2, 'Art-Hotel&Hostel Karetny Riad', 'Большой Каретный переулок дом 22 стр.4, Тверской', 'HOTEL', 0, ''),
       (2, 'Отель Элизиум на Пушкинской', 'Малый Палашевский переулок, 6, Тверской', 'HOTEL', 0, 'Отель «Элизиум на Пушкинской» расположен в Тверском районе Москвы, в 1,8 км от Большого театра, в 2,1 км от Государственного исторического музея и в 3,1 км от Мавзолея Ленина. До торгового комплекса «ГУМ» — приблизительно 3,1 км, а до Красной площади и Государственного музея изобразительных искусств имени А. С. Пушкина — 3,2 км. Расстояние до Московского Кремля составляет 4,2 км, а до Дома-музея В. М. Васнецова — 5 км. \n Все номера оснащены телевизором с плоским экраном, в числе удобств собственная ванная комната. В номерах установлен шкаф для одежды.'),
       (2, 'Ситикомфорт на Тверской', 'Малый Гнездниковский переулок, дом 12, Тверской', 'HOTEL', 3, 'Отель «Ситикомфорт на Тверской» расположен в Тверском районе Москвы, в 1,3 км от Большого театра, в 1,7 км от Государственного исторического музея и в 2,6 км от Мавзолея Ленина. Универмаг ГУМ и Красная площадь находятся в 2,7 км, а собор Василия Блаженного — в 2,8 км. Стойка регистрации отеля открыта круглосуточно, на всей территории работает бесплатный Wi-Fi, имеется камера хранения багажа. Для гостей организован трансфер от/до аэропорта. \n Во всех номерах отеля есть собственная ванная комната, телевизор с плоским экраном и письменный стол. В каждом номере установлен платяной шкаф. \n По утрам в отеле «Ситикомфорт на Тверской» сервируют континентальный завтрак.'),
       (2, 'Покровский Дом', 'ул. Покровка, 43, строение 2, Басманный', 'HOTEL', 0, 'Отель «Покровский дом» с бесплатной частной парковкой, круглосуточной стойкой регистрации, камерой хранения багажа и бесплатным Wi-Fi на всей территории удобно расположен в Москве в 4,3 км от спорткомплекса «Олимпийский» и Московского Кремля. Гостям предоставляется услуга экспресс-регистрации заезда и отъезда. \n В каждом номере имеется кондиционер, телевизор с плоским экраном и спутниковыми каналами, душ, чайник, фен и письменный стол. В числе удобств каждого номера — платяной шкаф и собственная ванная комната.');

INSERT INTO ROOMS (HOTEL, NAME, ROOMS_NUMBER)
VALUES (1, 'Двухместный номер с 2 отдельными кроватями', 2),
       (1, 'Двухместный номер с 2 отдельными кроватями', 4),
       (1, 'Семейный номер с общей ванной комнатой', 2),

       (2, 'Коттедж с 6 спальнями', 1),

       (3, 'Апартаменты с 3 спальнями', 1),
       (3, 'Апартаменты', 3),
       (3, 'Апартаменты с 2 спальнями', 1),

       (4, 'Общий десятиместный номер для мужчин и женщин', 2),

       (5, 'Стандартный двухместный номер с 1 кроватью', 4),
       (5, 'Стандартный двухместный номер с 2 отдельными кроватями', 2),
       (5, 'Двухместный номер «Комфорт» с 1 кроватью', 2),
       (5, 'Стандартный одноместный номер', 2),

       (6, 'Стандартный двухместный номер с 1 кроватью', 10),
       (6, 'Стандартный двухместный номер с 1 кроватью или 2 отдельными кроватями', 10),
       (6, 'Одноместный номер', 5),

       (7, 'Апартаменты-студио', 1),
       (7, 'Апартаменты', 3),

       (8, 'Стандартный номер «Пента»', 10),
       (8, 'Номер «Пента Плюс»', 10),
       (8, 'Номер Penta PlayerPad', 10),

       (9, 'Двухместный номер Делюкс с 1 кроватью или 2 отдельными кроватями', 5),
       (9, 'Полулюкс', 5),

       (10, 'Бюджетный двухместный номер с 2 отдельными кроватями', 6),
       (10, 'Стандартный двухместный номер с 1 кроватью', 10),
       (10, 'Улучшенный двухместный номер с 1 кроватью', 5),
       (10, 'Улучшенный номер-студио', 1),

       (11, 'Двухместный номер с 1 кроватью', 10),
       (11, 'Стандартный семейный номер', 1),
       (11, 'Двухместный номер Делюкс с 1 кроватью', 4),
       (11, 'Односпальная кровать в общем номере', 9),

       (12, 'Бюджетный двухместный номер с 1 кроватью', 5),
       (12, 'Стандартный двухместный номер с 1 кроватью', 5),
       (12, 'Двухместный номер с 1 кроватью', 4),
       (12, 'Люкс с гидромассажной ванной', 1),

       (13, 'Стандартный двухместный номер с 2 отдельными кроватями', 10),
       (13, 'Стандартный двухместный номер с 1 кроватью', 2),
       (13, 'Стандартный одноместный номер', 6),

       (14, 'Стандартный двухместный номер с 1 кроватью на первом этаже', 5),
       (14, 'Стандартный двухместный номер с 1 кроватью на втором этаже', 7),
       (14, 'Стандартный одноместный номер', 6);

INSERT INTO CONFIGURATION (ROOMS, CAPACITY, FOOD, PRICE)
VALUES (1, 2, NULL, 2292),
       (2, 2, NULL, 2491),
       (3, 5, NULL, 4982),
       (3, 6, NULL, 5979),
       (3, 7, NULL, 6477),

       (4, 20, NULL, 45000),
       (4, 10, NULL, 40500),
       (4, 9, NULL, 36000),

       (5, 9, NULL, 4900),
       (6, 8, NULL, 5175),
       (6, 7, NULL, 4950),
       (6, 6, NULL, 4500),
       (7, 6, NULL, 4250),

       (8, 10, NULL, 3600),
       (8, 7, NULL, 2700),
       (8, 9, NULL, 3300),
       (8, 8, NULL, 3000),
       (8, 6, NULL, 2400),
       (8, 5, NULL, 2100),
       (8, 4, NULL, 1800),
       (8, 3, NULL, 1200),
       (8, 1, NULL, 1000),

       (9, 2, 'BREAKFAST', 3800),
       (9, 1, 'BREAKFAST', 3500),
       (10, 2, 'BREAKFAST', 3800),
       (11, 2, 'BREAKFAST', 4500),
       (11, 1, 'BREAKFAST', 4000),
       (12, 1, 'BREAKFAST', 3500),

       (13, 2, 'BREAKFAST', 1999),
       (13, 2, 'BREAKFAST', 2599),
       (14, 2, 'BREAKFAST', 1999),
       (14, 2, 'BREAKFAST', 2599),
       (15, 1, 'BREAKFAST', 1799),
       (15, 1, 'BREAKFAST', 2099),

       (16, 2, NULL, 3581),
       (16, 2, NULL, 3316),
       (17, 2, NULL, 4054),
       (17, 2, NULL, 3754),

       (18, 2, 'BREAKFAST', 8000),
       (18, 2, 'BREAKFAST', 10300),
       (18, 1, 'BREAKFAST', 9150),
       (19, 2, 'BREAKFAST', 10000),
       (19, 2, 'BREAKFAST', 12300),
       (19, 1, 'BREAKFAST', 11150),
       (20, 2, 'BREAKFAST', 12000),
       (20, 2, 'BREAKFAST', 14300),
       (20, 1, 'BREAKFAST', 13150),

       (21, 2, 'BREAKFAST', 5005),
       (21, 2, 'BREAKFAST', 6506),
       (21, 2, 'BREAKFAST', 4504),
       (22, 3, 'BREAKFAST', 6006),
       (22, 3, 'BREAKFAST', 8258),
       (22, 3, 'BREAKFAST', 5405),

       (23, 2, NULL, 2763),
       (24, 2, NULL, 3333),
       (25, 2, NULL, 3804),
       (26, 4, NULL, 6006),

       (23, 2, NULL, 1300),
       (24, 2, NULL, 1500),
       (25, 2, NULL, 1700),
       (26, 1, NULL, 800),

       (27, 2, NULL, 2199),
       (28, 2, NULL, 2499),
       (29, 2, NULL, 2999),
       (30, 2, NULL, 3499),

       (30, 2, 'BREAKFAST', 3503),
       (30, 2, 'BREAKFAST', 4304),
       (30, 2, 'BREAKFAST', 3153),
       (31, 2, 'BREAKFAST', 4004),
       (31, 2, 'BREAKFAST', 4805),
       (31, 2, 'BREAKFAST', 3604),
       (32, 1, 'BREAKFAST', 3003),
       (32, 1, 'BREAKFAST', 3804),
       (32, 1, 'BREAKFAST', 2703),

       (33, 2, NULL, 3900),
       (34, 2, NULL, 3900),
       (35, 1, NULL, 2900);